In [15]:
import sqlite3
import pandas as pd

In [12]:
con = sqlite3.connect("data/cascade-6275403559731200-v1.sqlite")

In [13]:
df = pd.read_sql_query("SELECT * from nodes", con)

In [14]:
df

      id                code                name  parent
0      1    Mampang Prapatan    Mampang Prapatan       2
1      2    Mampang Prapatan    Mampang Prapatan     104
2      3               13250               13250       4
3      4     Jatinegara Kaum     Jatinegara Kaum     121
4      5  Rawa Badak Selatan  Rawa Badak Selatan       6
..   ...                 ...                 ...     ...
582  583               10650               10650     411
583  584               14240               14240      83
584  585               11460               11460     419
585  586               13760               13760     443
586  587               13240               13240     226

[587 rows x 4 columns]